tutorials/preProcessing/PDRsetFields/simplePipeCage/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// ************************************************************************* //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outer
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    seaGround
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    mergingFaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wallFaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    ySymmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
